function Lyric(song){
    this.song = song;

}

Lyric.prototype  = {
    rendlyricArray: function (){
        var lrcLocation = this.song.lyric;
        if(lrcLocation == null || lrcLocation == undefined){
            return;
        }
        //this.requestFile(lrcLocation);
        this.directGetLyric();
    },

    requestFile: function request_file(url){

       var  xmlhttp = null;
        if (window.XMLHttpRequest){// code for all new browsers
            xmlhttp = new XMLHttpRequest();
        }else if (window.ActiveXObject){// code for IE5 and IE6
            xmlhttp=new ActiveXObject("Microsoft.XMLHTTP");
        }
        if (xmlhttp!=null)
        {
            xmlhttp.onreadystatechange=state_Change.bind(this);
            xmlhttp.open("GET",url,true);
            xmlhttp.setRequestHeader("Content-Type", "application/text");
            xmlhttp.setRequestHeader("Accept","application/text");
            xmlhttp.send(null);
        }
        else
        {
            alert("Your browser does not support XMLHTTP.");
        }

        function state_Change(){
            if (xmlhttp.readyState==4){// 4 = "loaded"
                if (xmlhttp.status==200){// 200 = OK
                        var string = xmlhttp.responseText;
                        var e = document.createEvent("HTMLEvents");
                        e.initEvent('lyricReadying',false, false);
                        e.data = string;
                        document.dispatchEvent(e);
                    }else {
                    this.directGetLyric();
                }
            }else{
                this.directGetLyric();
            }

        }
    },

    directGetLyric: function direct_get_lyric(){
        var xhn = "[00:00.28]喜欢你\
                 [00:01.84]作词：黄家驹\
                 [00:02.93]作曲：黄家驹\
                 [00:04.00]演唱：G.E.M. 邓紫棋\
                 [00:09.00]\
                 [00:13.46]细雨带风湿透黄昏的街道\
                 [00:18.46]\
                 [00:19.78]抹去雨水双眼无故地仰望\
                 [00:25.11]望向孤单的晚灯\
                 [00:27.74]\
                 [00:28.47]是那伤感的记忆\
                 [00:31.16]\
                 [00:35.15]再次泛起心里无数的思念\
                 [00:40.79]\
                 [00:41.72]以往片刻欢笑仍挂在脸上\
                 [00:47.08]愿你此刻可会知\
                 [00:49.76]\
                 [00:50.59]是我衷心的说声\
                 [00:53.18]\
                 [00:56.03]喜欢你 那双眼动人 笑声更迷人\
                 [01:04.46]\
                 [01:05.23]愿再可 轻抚你 那可爱面容\
                 [01:13.83]\
                 [01:14.63]挽手说梦话 像昨天 你共我\
                 [01:23.79]\
                 [01:29.10]满带理想的我曾经多冲动\
                 [01:34.17]\
                 [01:35.18]抱怨与她相爱难有自由\
                 [01:40.75]愿你此刻可会知\
                 [01:43.53]\
                 [01:44.28]是我衷心的说声\
                 [01:47.76]\
                 [01:49.55]喜欢你 那双眼动人 笑声更迷人\
                 [01:58.15]\
                 [01:58.97]愿再可 轻抚你 那可爱面容\
                 [02:07.53]\
                 [02:08.35]挽手说梦话 像昨天 你共我\
                 [02:17.82]\
                 [02:29.99]每晚夜里自我独行\
                 [02:33.66]随处荡 多冰冷\
                 [02:39.21]\
                 [02:42.57]以往为了自我挣扎\
                 [02:46.38]从不知 她的痛苦\
                 [02:53.47]\
                 [02:58.83]喜欢你 那双眼动人\
                 [03:04.35]\
                 [03:05.10]笑声更迷人\
                 [03:07.40]\
                 [03:08.17]愿再可 轻抚你 那可爱面容\
                 [03:17.02]\
                 [03:17.88]挽手说梦话\
                 [03:20.14]\
                 [03:20.95]像昨天 你共我\
                 [03:27.20]\
                 [03:28.42]哦哦哦  哦哦\
                 [03:33.44]哦哦哦  哦哦\
                 [03:37.52]\
                 [03:38.64]哦哦哦  哦哦\
                 [03:42.43]哦哦哦  哦哦\
                 [03:46.95]哦哦哦  哦哦\
                 [03:51.99]哦哦哦  哦哦\
                 [03:55.28]哦哦哦  哦哦\
                 [03:59.11]\
                 [03:59.64]哦哦哦  哦哦";

        var tbydy = "[ti:天边一朵云]\
                     [ar:声音碎片]\
\
                     [00:03.99]    歌曲: 天边一朵云\
                     [00:09.20]    演唱: 声音碎片乐队\
                     [00:15.28]\
                     [00:30.31]    一朵云的色彩\
                     [00:36.65]　　单纯得只有黑白\
                     [00:44.48]　　彩虹像善意的谎言\
                     [00:58.95]　　一朵云的骄傲\
                     [01:06.03]　　轻浮得没有重量\
                     [01:13.25]　　风一吹\
                     [01:16.92]　　誓言就凌乱\
                     [01:24.17]　　\
                     [01:27.38]　　像天那边一朵云\
                     [01:35.87]　　我们的眼神和姿态\
                     [01:42.94]　　像天那边一朵云\
                     [01:50.65]　　我们的行走和声音\
                     [01:57.32]　　像一朵云\
                     [02:01.40]　　一朵云 而已\
                     [02:08.20]　　\
                     [02:11.15]　　一朵云的故乡\
                     [02:17.76]　　深沉得只有背景\
                     [02:25.10]　　他们的寻找像出走\
                     [02:39.78]　　一朵云的一生\
                     [02:47.34]　　抓不住另一朵云\
                     [02:53.10]　　像穷人把流浪叫做自由\
                     [03:06.77]　　\
                     [03:08.37]　　像天那边一朵云\
                     [03:15.74]　　我们的眼神和姿态\
                     [03:22.36]　　像天那边一朵云\
                     [03:29.22]　　我们的行走和声音\
                     [03:36.20]　　像一朵云\
                     [03:40.94]　　一朵云 而已\
                     \
                     [03:57.35]　　像天那边一朵云\
                     [04:05.89]　　我们的眼神和姿态\
                     [04:13.44]　　像天那边一朵云\
                     [04:20.70]　　我们的行走和声音\
                     [04:27.57]　　像一朵云\
                     [04:31.60]　　一朵云 而已\
                     \
                     [04:41.31]\
                     [04:41.60]　　像天那边一朵云\
                     [04:48.99]　　我们的眼神和姿态\
                     [04:56.20]　　像天那边一朵云\
                     [05:03.45]　　我们的行走和声音\
                     [05:10.86]　　像一朵云\
                     [05:14.81]　　一朵云 而已\
                 ";
        var rgmyn = "[00:02.62]如果没有你\
                     [00:05.54]演唱：莫文蔚\
                     [00:08.35]\
                     [00:35.25]Hey～我真的好想你\
                     [00:42.14]现在窗外面 又开始下着雨\
                     [00:50.86]眼睛干干的 有想哭的心情\
                     [00:57.45]不知道你现在到底在哪里\
                     [01:02.44]\
                     [01:05.59]Hey～我真的好想你\
                     [01:12.62]太多的情绪 没适当的表情\
                     [01:21.29]最想说的话 我该从何说起\
                     [01:27.92]你是否也像我一样在想你\
                     [01:32.96]\
                     [01:35.65]如果没有你 没有过去\
                     [01:39.65]我不会有伤心\
                     [01:43.10]但是有如果 还是要爱你\
                     [01:48.99]\
                     [01:50.77]如果没有你 我在哪里\
                     [01:54.88]又有什么可惜\
                     [01:58.38]反正一切来不及\
                     [02:02.18]反正没有了自己\
                     [02:06.32]\
                     [02:07.34]Hey～我真的好想你\
                     [02:13.61]不知道你现在到底在哪里\
                     [02:18.97]\
                     [02:33.51]Hey～我真的好想你\
                     [02:40.32]现在窗外面 又开始下着雨\
                     [02:48.90]眼睛干干的 有想哭的心情\
                     [02:55.51]不知道你现在到底在哪里\
                     [03:01.10]\
                     [03:03.67]Hey～我真的好想你\
                     [03:10.78]太多的情绪 没适当的表情\
                     [03:19.42]最想说的话 我应该从何说起\
                     [03:25.96]你是否也像我一样在想你\
                     [03:31.81]\
                     [03:33.70]如果没有你 没有过去\
                     [03:37.72]我不会有伤心\
                     [03:41.39]但是有如果 还是要爱你\
                     [03:48.42]\
                     [03:49.12]如果没有你 我在哪里\
                     [03:53.03]又有什么可惜\
                     [03:56.41]反正一切来不及\
                     [04:00.31]反正没有了自己\
                     [04:04.88]\
                     [04:05.27]Hey～我真的好想你\
                     [04:11.75]不知道你现在到底在哪里\
                     [04:17.71]\
                     [04:19.42]你是否也像我一样在想你\
                     [04:26.78]\
                 ";

        var trdzw = "[00:01.42]突然的自我\
                     [00:02.38]演唱：伍佰\
                     [00:03.67]\
                     [00:31.46]听见你说 朝阳起又落\
                     [00:37.54]晴雨难测 道路是脚步多\
                     [00:43.68]我已习惯 你突然间的自我\
                     [00:49.87]挥挥洒洒 将自然看通透\
                     [00:58.46]那就不要留 时光一过不再有\
                     [01:05.20]你远眺的天空 挂更多的彩虹\
                     [01:10.62]我会紧紧的 将你豪情放在心头\
                     [01:17.34]在寒冬时候 就回忆你温柔\
                     [01:23.00]把开怀填进我的心扉\
                     [01:29.10]伤心也是带着微笑的眼泪\
                     [01:35.92]数不尽相逢\
                     [01:39.00]等不完守候\
                     [01:42.32]如果仅有此生 又何用待从头\
                     [01:48.19]\
                    [02:15.18]那就不要留 时光一过不再有\
                     [02:21.72]你远眺的天空 挂更多的彩虹\
                     [02:27.41]我会紧紧的 将你豪情放在心头\
                     [02:33.82]在寒冬时候 就回忆你温柔\
                     [02:39.39]把开怀填进我的心扉\
                     [02:45.50]伤心也是带着微笑的眼泪\
                     [02:52.07]数不尽相逢\
                     [02:55.03]等不完守候\
                     [02:58.08]如果仅有此生 又何用待从头\
                     [03:04.01]\
                             ";

        var hd = "[ti:]\
                 [ar:]\
                 [al:]\
                 [offset:0]\
\
                 [00:00.00]红  豆\
                 [00:03.86]作词：林 夕 作曲：柳重言\
                 [00:06.75]演唱：王 菲\
                 [00:10.45]\
                 [00:16.66]还没好好地感受\
                 [00:20.57]雪花绽放的气候\
                 [00:24.72]我们一起颤抖\
                 [00:28.08]会更明白  什么是温柔\
                 [00:34.12]还没跟你牵着手\
                 [00:37.81]走过荒芜的沙丘\
                 [00:42.16]可能从此以后  学会珍惜\
                 [00:47.52]天长和地久\
                 [00:50.52]有时候  有时候\
                 [00:54.94]我会相信一切有尽头\
                 [00:59.09]相聚离开  都有时候\
                 [01:03.50]没有什么会永垂不朽\
                 [01:07.86]可是我  有时候\
                 [01:12.11]宁愿选择留恋不放手\
                 [01:16.46]等到风景都看透\
                 [01:20.70]也许你会陪我  看细水长流\
                 [01:29.36]\
                 [01:42.33]还没为你把红豆\
                 [01:46.47]熬成缠绵的伤口\
                 [01:50.69]然后一起分享\
                 [01:53.88]会更明白  相思的哀愁\
                 [01:59.33]还没好好地感受\
                 [02:03.38]醒著亲吻的温柔\
                 [02:07.75]可能在我左右\
                 [02:11.05]你才追求  孤独的自由\
                 [02:18.90]有时候  有时候\
                 [02:22.91]我会相信一切有尽头\
                 [02:27.12]相聚离开  都有时候\
                 [02:31.30]没有什么会永垂不朽\
                 [02:35.72]可是我  有时候\
                 [02:39.84]宁愿选择留恋不放手\
                 [02:44.34]等到风景都看透\
                 [02:48.57]也许你会陪我  看细水长流\
                 [02:56.38]\
                 [03:08.31]有时候  有时候\
                 [03:11.97]我会相信一切有尽头\
                 [03:16.33]相聚离开  都有时候\
                 [03:20.64]没有什么会永垂不朽\
                 [03:24.94]可是我  有时候\
                 [03:29.15]宁愿选择留恋不放手\
                 [03:33.45]等到风景都看透\
                 [03:37.75]也许你会陪我  看细水长流\
                 [03:49.01]\
             ";
        var lyc = xhn;
        switch(this.song.id){
            case 0:
                lyc = xhn;
                break;
            case 1:
                lyc = tbydy;
                break;
            case 2:
                lyc = rgmyn;
                break;
            case 3:
                lyc = trdzw;
                break;
            case 4:
                lyc = hd;
                break;
        }
        var event = document.createEvent("Event");
        event.initEvent('build',true, true);
        event.data = lyc;
        document.dispatchEvent(event);
    }



}
